
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * module.kv_hmi.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0]
  * module.kv_hmi.azurerm_user_assigned_identity.managed_identity[0]
* Delete
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;561cef06-a643-464b-8c03-9ffbd674230a&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.kv_hmi.azurerm_key_vault_access_policy.implicit_managed_identity_access_policy[0] will be created
  + resource "azurerm_key_vault_access_policy" "implicit_managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-bootstrap-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-bootstrap-kv-prod"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy["561cef06-a643-464b-8c03-9ffbd674230a"] will be destroyed
  # (because key ["561cef06-a643-464b-8c03-9ffbd674230a"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-bootstrap-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-bootstrap-kv-prod/objectId/561cef06-a643-464b-8c03-9ffbd674230a" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/hmi-bootstrap-prod-rg/providers/Microsoft.KeyVault/vaults/hmi-bootstrap-kv-prod" -> null
      - object_id               = "561cef06-a643-464b-8c03-9ffbd674230a" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.kv_hmi.azurerm_user_assigned_identity.managed_identity[0] will be created
  + resource "azurerm_user_assigned_identity" "managed_identity" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "hmi-prod-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-prod-rg"
      + tags                = {
          + "application"         = "hearings-management-interface"
          + "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures-bootstrap.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#hearing-management-information"
          + "environment"         = "production"
          + "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":10,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->